* Finding the PDF of the brightness fluctuations
For the discussion of the sigma POS sigma LOS correlation, we want to see whether the emissivity fluctuations  combined with radial expansion might be contributing.

If this is the case, then sigma(POS) / sigma(LOS) ought to increase as the width of the emissivity distribution increases.

In Arthur et al (2016) we showed that the emissivity sigma is about twice the surface brightness sigma, with the later being estimated from the Ha maps.

So we will calculate it for 30 Doradus in order to compare with Orion


** PDF of Ha map for 30 Dor
:PROPERTIES:
:ID:       B262582F-C826-4F60-8201-36D7FA11506E
:END:
- This is based on what I did for the Orion project
  - See [[file:../../../OrionStats/NewMoments/turb-velocity-stats.org]]
- Python program [[file:bright-hist-multi.py]] 



#+begin_src sh :results file
python bright-hist-multi.py
#+end_src

#+RESULTS:
[[file:bright-hist-multi.pdf]]



** Results
- For the majority of sources, there is not much evidence of any relation
- However, 30 Dor has significantly higher brightness fluctuations and also a significantly higher sigma ratio
- And also, significantly higher absolute sigma_pos
- Theoretical prediction for compressive forcing is that \sigma_\rho = M
  - And we should have emissivity fluctuations \sigma_E = 2 \sigma_\rho
  - And surface brightness fluctuations \sigma_S = (1/3) \sigma_E from projection
  - So we \sigma_S = (2/3) M, which we can plot
  - For solenoidal case, it is (2/9) M,



** Brightness to velocity fluctuations
- See handwritten notes
  - [[file:brightness-to-velocity-fluctuations.pdf]]
- Emissivity contrast is \alpha
- Emissivity width is
  \[
  \sigma_E = \frac{
  [3(\alpha + \alpha^{-1})^2 - 4(1 + \alpha + \alpha^{-1})]^{1/2}
  }{
  2 + \alpha + \alpha^{-1}
  }
  \]
- Line of sight velocity width
  \[
  \sigma(los) = \frac{\alpha^{1/2}}{1 + \alpha}
  \]
- Plane of sky velocity width
  \[
  \sigma(pos) = \frac{\vert\alpha - 1\vert}{2 (1 + \alpha)}
  \]


|  \alpha |    \sigma_E | \sigma(los) | \sigma(pos) | \sigma(pos) / \sigma(los) |    \sigma_S |
|----+-------+--------+--------+-----------------+-------|
|  1 |     0 |  0.500 |      0 |           0.000 |     0 |
|  2 | 0.484 |  0.471 |  0.167 |           0.355 | 0.333 |
|  3 | 0.750 |  0.433 |  0.250 |           0.577 | 0.500 |
| 10 | 1.337 |  0.287 |  0.409 |           1.425 | 0.818 |
| 30 | 1.586 |  0.177 |  0.468 |           2.644 | 0.935 |
#+TBLFM: $2=sqrt(3 ($1 + 1/$1)**2 - 4 (1 + $1 + 1/$1))/(2 + $1 + 1/$1);f3::$3=sqrt($1)/(1+$1);f3::$4=($1 - 1)/(2(1+$1));f3::$5=$4/$3;f3::$6=($1 - 1)/((1+$1));f3

So we see that \sigma(pos)increases linearly with \sigma_S. If the line-of-sight velocity difference were the same in all sources, then this would give a line like we drew in Fig 12h, but the direction of causality is the opposite here.

Previously, we were saying that the true 3d velocity fluctuations were causing the brightness fluctuations. Now, we are saying that the brightness fluctuations plus the velocity gradient are causing the apparent POS velocity fluctuations. ;

On the other hand, the los velocity dispersion decreases with increasing brightness fluctuations because we become dominated by a single layer. However the fact that we only have two layers in the toy model means that this effect is probably overestimated.

*** TODO Python program to make a graph of these relations
- Plot all those columns from the previous table against \alpha (put \alpha on a log scale)

#+begin_src python :eval no :tangle bright-to-vel-fluct.py
  from matplotlib import pyplot as plt
  import seaborn as sns
  import numpy as np

  figfile = "bright-to-vel-fluct.pdf"
  sns.set_context("talk")
  sns.set_color_codes()
  fig, ax = plt.subplots()

  alpha = np.logspace(0.0, 1.6, 500)

  def plot_and_label(ax, x, y, label, pad="  "):
      [line] = ax.plot(x, y)
      ax.text(x[-1], y[-1], pad + label,
              color=line.get_color(), ha="left", va="center",
              )

  plot_and_label(
      ax,
      alpha,
      np.sqrt(alpha)  / (1 + alpha),
      label=r"$\sigma_{\mathrm{los}} / \beta$",
  )
  extra_sig = 0.25
  ax.plot(
      alpha,
      np.hypot(np.sqrt(alpha)  / (1 + alpha), extra_sig),
      linestyle="dashed",
      color=ax.lines[-1].get_color(),
  )
  plot_and_label(
      ax,
      alpha,
      0.5 * np.abs(alpha - 1)  / (1 + alpha),
      label=r"$\sigma_{\mathrm{pos}} / \beta$",
  )
  plot_and_label(
      ax,
      alpha,
      np.abs(alpha - 1)  / (1 + alpha),
      label=r"$\sigma_S$",
  )
  gamma = alpha + 1/alpha
  plot_and_label(
      ax,
      alpha,
      np.sqrt(3 * gamma ** 2 - 4 * (1 + gamma)) / (2 + gamma),
      label=r"$\sigma_E$",
  )
  ax.set(
      xscale="log",
      xlabel=r"Emissivity contrast, $\alpha$",
  )
  ax.set_xticks([1, 3, 10, 30])
  ax.set_xticklabels(["1", "3", "10", "30"])
  ax.set_xlim(1, None)
  ax.set_yticks([0.0, 0.5, 1.0, 1.5])
  ax.set_yticklabels(["", "0.5", "1.0", "1.5"])
  ax.set_ylim(0, None)
  sns.despine()
  fig.savefig(figfile, bbox_inches="tight")

  print(figfile, end="")


#+end_src

#+begin_src sh :results file
python bright-to-vel-fluct.py
#+end_src

#+RESULTS:
[[file:bright-to-vel-fluct.pdf]]
